{
  "2560": {
    "description": "Find Bozu Roku, who is hiding in the first cave below the Monastery."
  },
  "2563": {
    "description": "Smash 7 piles of debris in the Ninjago Caves and rebuild each one into an Altar of Imagination."
  },
  "2566": {
    "description": "Smash 10 Skeleton Coffins on the Ninjago Battlefield before the Skeletons can pop out!"
  },
  "2567": {
    "description": "Destroy 2 of the Skeletons' Siege Towers on the Ninjago Battlefield."
  },
  "2570": {
    "description": "Show the Maelstrom Dagger to Vanda Darkflame in Nexus Tower."
  },
  "2574": {
    "description": "Smash Skeleton Marksmen on the Ninjago Battlefield until you find 1 Shoulder Socket Wrench."
  },
  "2575": {
    "description": "Smash Skeleton Marksmen on the Ninjago Battlefield until you find 3 Hammer Toes."
  },
  "2576": {
    "description": "Smash Skeleton Commandos on the Ninjago Battlefield until you find 5 Finger Nails."
  },
  "2577": {
    "description": "Smash rocks in the Ninjago Caves until you find a Diamond Gem."
  },
  "2578": {
    "description": "Tell Nya that Jay is almost done with the Portable Chaos Cleaner."
  },
  "2579": {
    "description": "Find the Dragon Mask in a chest hidden in the Cave of Black Echoes below the Monastery."
  },
  "2580": {
    "description": "Equip the Dragon Mask for Zane in the Monastery Ice Dojo."
  },
  "2581": {
    "description": "Equip the Dragon Mask and use Speedchat to perform the Dragon Roar for Cole in the Dojo of Earth."
  },
  "2582": {
    "description": "Find Cringe Lo, who is hiding somewhere in the Ninjago Monastery."
  },
  "2583": {
    "description": "Find 10 pieces of Flame Fruit and take them to Cringe Lo in the Dojo of Lightning."
  },
  "2584": {
    "description": "Take Cringe Lo's Love Note to Nya in the Ninjago Monastery."
  },
  "2585": {
    "description": "Go back to the Dojo of Lightning and tell Cringe Lo that Nya isn't interested in him."
  },
  "2586": {
    "description": "Go to Bubu Mumu in the Ninjago Monastery and tell him that Cringe Lo has decided to quit his job."
  },
  "2587": {
    "description": "Find Cringe Lo in the Ninjago Caves below the Monastery."
  },
  "2588": {
    "description": "Take the Lucky Wolf's Paw back to Cringe Lo in the Ninjago Caves."
  },
  "2589": {
    "description": "Talk to Cringe Lo when he gets back to his hiding spot in the Dojo of Lightning."
  },
  "2590": {
    "description": "Smash Earth Blossoms in the Ninjago Monastery to collect 5 Rock Fruit."
  },
  "2591": {
    "description": "Buy a Hardtack Biscuit from Burky Urchin in the Gnarled Forest Ravine."
  },
  "2592": {
    "description": "Find 20 Onyx Gems by smashing rocks in the caves below the Monastery."
  },
  "2594": {
    "description": "Smash Skeleton Troopers on the Ninjago Battlefield until you collect 10 Rib Bones."
  },
  "2595": {
    "description": "Smash Bone Wolves in the Ninjago Caves until you find 15 Tail Bones."
  },
  "2596": {
    "description": "Smash Bonezai in the Ice Shrine below the Monastery and get his Eye Bone."
  },
  "2597": {
    "description": "Smash Krazi in the Lightning Shrine below the Monastery and get his Funny Bone."
  },
  "2598": {
    "description": "Smash Frakjaw in the Fire Shrine below the Monastery and get his Jaw Bone."
  },
  "2601": {
    "description": "Get 10 Rockolate Bars from Johnny Umami. You'll need to help him make them first."
  },
  "2602": {
    "description": "Interact with one of the Dragon statues in the Dojo of Earth. Then tame the pet that appears."
  },
  "2604": {
    "description": "Find the 5 floating Treasure Chests that Johnny Thunder hid around the Ninjago Monastery."
  },
  "2608": {
    "description": "Smash 5000 more Smashables."
  },
  "2609": {
    "description": "Smash 5000 more enemies."
  },
  "2610": {
    "description": "Smash 5000 more Survival enemies."
  },
  "2611": {
    "description": "Complete 5000 more Quick Builds."
  },
  "2612": {
    "description": "Complete 10 collection Quick Builds."
  },
  "2613": {
    "description": "Complete 100 collection Quick Builds."
  },
  "2614": {
    "description": "Complete 500 collection Quick Builds."
  },
  "2615": {
    "description": "Grow 500 more flowers."
  },
  "2616": {
    "description": "Smash 2500 more Stromlings."
  },
  "2617": {
    "description": "Report back to Epsilon Starcracker on the battlefield."
  },
  "2618": {
    "description": "Talk to Wisp Lee at the destroyed Paradox Lab in Avant Gardens."
  },
  "2619": {
    "description": "Use the Maelstrom Vacuum to collect 8 Maelstrom Samples from the Spider Queen's trail."
  },
  "2620": {
    "description": "Interact with the bricks in the Paradox Lab cage to apply the Maelstrom Cube to them."
  },
  "2621": {
    "description": "Report back to Epsilon Starcracker."
  },
  "2622": {
    "description": "Report to Melodie Foxtrot by the caves behind the Paradox Lab in Avant Gardens."
  },
  "2623": {
    "description": "Inform Beck Strongheart about the Spider Queen."
  },
  "2624": {
    "description": "Collect 4 Hamster Wheels by smashing fans on the Monument."
  },
  "2625": {
    "description": "Collect 3 Flashlights by smashing lasers on the Monument."
  },
  "2626": {
    "description": "Quick Build 1 button on the Monument."
  },
  "2627": {
    "description": "Quick Build 1 bouncer on the Monument."
  },
  "2628": {
    "description": "Quick Build 1 moving platform on the Monument."
  },
  "2629": {
    "description": "Scare 5 birds off of the  Avant Gardens Monument."
  },
  "2632": {
    "description": "Smash 20 Stromlings on the Avant Gardens battlefield."
  },
  "2633": {
    "description": "Smash 10 Stromling Mechs on the Avant Gardens battlefield."
  },
  "2634": {
    "description": "Smash 15 Stromlings on the Avant Gardens battlefield."
  },
  "2635": {
    "description": "Smash 5 Stromling Mechs on the Avant Gardens battlefield."
  },
  "2637": {
    "description": "Smash 10 Dark Spiderlings in the Avant Gardens caves."
  },
  "2638": {
    "description": "Smash 10 Dark Spiderlings in the Avant Gardens caves."
  },
  "2639": {
    "description": "Quick Build the Satellite Beacon in the Sentinel Base Camp."
  },
  "2640": {
    "description": "Quick Build the Satellite Beacon near the entrance to the Paradox caves."
  },
  "2641": {
    "description": "Quick Build the Satellite Beacon under the damaged road."
  },
  "2642": {
    "description": "Quick Build the Satellite Beacon near the Paradox Lab ruins."
  },
  "2643": {
    "description": "Survive for 3 minutes in Avant Gardens Survival."
  },
  "2644": {
    "description": "Smash Lightning Blossoms in the Ninjago Monastery to collect 5 Shock Fruit."
  },
  "2645": {
    "description": "Buy 1 Buttery Croissant from Farnham Spoon at the Nimbus Station Race Place."
  },
  "2646": {
    "description": "Buy 1 Healing Drumstick from Farnham Spoon at the Nimbus Station Race Place."
  },
  "2647": {
    "description": "Find 3 Stinky Fish in Gnarled Forest, or buy them from Farnham Spoon in Nimbus Station or Olivia Nightshade in Nexus Tower."
  },
  "2648": {
    "description": "Buy a Hiccup Tablet from Farnham Spoon at the Nimbus Station Race Place."
  },
  "2649": {
    "description": "Buy a Cup of Yo from Fermie LaBoosh at the Pirates' Camp in Gnarled Forest."
  },
  "2650": {
    "description": "Smash Ice Blossoms in the Ninjago Monastery to collect 6 Frost Fruit."
  },
  "2651": {
    "description": "Find a bottle of Tough Buff Sauce by searching around Forbidden Valley."
  },
  "2652": {
    "description": "Buy a BBQ Blast Hot Dog from Farnham Spoon at the Nimbus Station Race Place."
  },
  "2653": {
    "description": "Gather more bricks for the wall at the Sentinel Base Camp."
  },
  "2654": {
    "description": "Quick Build the wall at the Sentinel Base Camp."
  },
  "2655": {
    "description": "Smash Bamboo in the Ninjago Monastery to collect 10 Bamboo Bites."
  },
  "2656": {
    "description": "Buy 3 Sushi from Kammy Kazei at the Paradox Refinery in Forbidden Valley."
  },
  "2657": {
    "description": "Buy 2 Tasty Fish from Fermie LaBoosh at the Pirates' Camp in Gnarled Forest."
  },
  "2658": {
    "description": "Smash Fire Blossoms in the Ninjago Monastery to collect 8 Flame Fruit."
  },
  "2659": {
    "description": "Smash Ice Blossoms in the Ninjago Monastery to collect 8 Frost Fruit."
  },
  "2660": {
    "description": "Buy 2 Cherry Blasts from Heimlich Stewblaster on Crux Prime."
  },
  "2661": {
    "description": "Smash fans on the Avant Gardens Monument and collect 3 Hamster Wheels."
  },
  "2662": {
    "description": "Smash lasers on the Avant Gardens Monument and collect 4 Flashlights."
  },
  "2663": {
    "description": "Quick Build 1 button on the Avant Gardens Monument."
  },
  "2664": {
    "description": "Quick Build 1 Bouncer on the Avant Gardens Monument."
  },
  "2665": {
    "description": "Quick Build 1 moving platform on the Avant Gardens Monument."
  },
  "2666": {
    "description": "Shoo 10 birds off of the Avant Gardens Monument."
  },
  "2667": {
    "description": "Smash Earth Blossoms in the Ninjago Monastery to collect 10 Rock Fruit."
  },
  "2668": {
    "description": "Buy 5 Hot Chocolate from Fermie LaBoosh at the Pirates' Camp in Gnarled Forest."
  },
  "2669": {
    "description": "Smash rocks in the Ninjago Caves to find 5 Onyx Gems."
  },
  "2670": {
    "description": "Smash Bamboo Stalks in the Ninjago Monastery to collect 5 Bamboo Bites."
  },
  "2671": {
    "description": "Interact with the Binoculars at the end of the broken road to see a view of the Monument."
  },
  "2674": {
    "description": "Smash and Quick Build the destroyed robot by the Paradox Lab in Avant Gardens."
  },
  "2675": {
    "description": "Use Dusty Holster's Plunger Gun to shoot 6 targets around Avant Gardens."
  },
  "2676": {
    "description": "Go to 5 player Properties and use Swabby's Shovel to dig up 5 treasures."
  },
  "2677": {
    "description": "Talk to Wisp Lee in Avant Gardens about a Maelstrom Cube for Hu Where."
  },
  "2678": {
    "description": "Use the Maelstrom Vacuum to collect 10 Maelstrom Samples in Avant Gardens."
  },
  "2679": {
    "description": "Complete the Monument Race in Avant Gardens."
  },
  "2680": {
    "description": "As a solo player, defeat Murgle Blotch in the Battle of Nimbus Station."
  },
  "2681": {
    "description": "As a solo player, defeat Kinga Hurl in the Battle of Nimbus Station."
  },
  "2682": {
    "description": "As a solo player, defeat Whack Bliddo in the Battle of Nimbus Station."
  },
  "2683": {
    "description": "As a solo player, defeat the 4 Riders in the Battle of Nimbus Station."
  },
  "2684": {
    "description": "Talk to Nexus Jay in Nimbus Plaza."
  },
  "2685": {
    "description": "Talk to Nexus Jay in Nimbus Plaza."
  },
  "2686": {
    "description": "Talk to Nexus Jay in Nimbus Plaza."
  },
  "2687": {
    "description": "Talk to Nexus Jay in Nimbus Plaza."
  },
  "2689": {
    "description": "Quick Build 25 Bouncers, buttons or moving platforms on the Avant Gardens Monument."
  },
  "2690": {
    "description": "Quick Build 100 more Bouncers, buttons or moving platforms on the Avant Gardens Monument."
  },
  "2691": {
    "description": "Click on the orange circle at the top of the screen."
  },
  "2692": {
    "description": "Use Stinky Fish to feed 5 sharks in the water around Nimbus Station."
  },
  "2711": {
    "description": "Search the Monastery Storeroom behind Sensei Wu to find a way into the Ninjago Caves."
  },
  "2712": {
    "description": "Look for the orange banners in the Ninjago Caves and find the Earth Shrine."
  },
  "2713": {
    "description": "Rescue all 6 trapped villagers in the Ninjago Caves."
  },
  "2720": {
    "description": "Use a pet on the Pet Dig by the Ninjago rocket launchpad to find a treasure."
  },
  "2721": {
    "description": "Use a pet on the Pet Dig under the Ninjago Battlefield bridge to find a treasure."
  },
  "2722": {
    "description": "Use a pet on the Pet Dig beneath the Rock Face in the Earth Garden to find a treasure."
  },
  "2723": {
    "description": "Use a pet on the Pet Dig by the entrance to the Ninjago Caves to find a treasure."
  },
  "2724": {
    "description": "Use a pet on the Pet Dig by the Black Banner in the Ninjago Caves to find a treasure."
  },
  "2726": {
    "description": "Find all 10 of Cole's Climbing Flags around the Ninjago Monastery."
  },
  "2727": {
    "description": "Show the Maelstrom Dagger to Echs Ray at the Paradox Refinery in Forbidden Valley."
  },
  "2728": {
    "description": "Smash the Refinery pipes and Quick Build the Chaos Cleaner machine. Then interact with it to purify the Maelstrom Dagger."
  },
  "2729": {
    "description": "Give the Portable Chaos Cleaner Instructions to Jay in the Dojo of Lightning."
  },
  "2730": {
    "description": "Buy 3 Bancha Tea from Johnny Umami and take them back to Kai in the Dojo of Fire."
  },
  "2735": {
    "description": "Look for the white Ice banners in the Ninjago Caves and find the Ice Shrine."
  },
  "2739": {
    "description": "Collect 15 Backpack Flags in Ninjago."
  },
  "2741": {
    "description": "Collect 15 Heart Flags in Ninjago."
  },
  "2742": {
    "description": "Equip the Trial Faction Gear you borrowed from Melodie Foxtrot."
  },
  "2743": {
    "description": "Talk to Theo Balfour in the tunnel behind the Sentinel Base Camp."
  },
  "2748": {
    "description": "Return to the Spider Queen's lair and smash her a second time."
  },
  "2749": {
    "description": "Smash Frakjaw in the Fire Shrine in the caves below the Monastery."
  },
  "2750": {
    "description": "Smash Chopov in the Earth Shrine in the caves below the Monastery."
  },
  "2751": {
    "description": "Smash Bonezai in the Ice Shrine in the caves below the Monastery."
  },
  "2752": {
    "description": "Smash Krazi in the Lightning Shrine in the caves below the Monastery."
  },
  "2753": {
    "description": "Get the Earth Key from the attic above the Dojo of Earth."
  },
  "2754": {
    "description": "Get the Ice Key from the attic above the Dojo of Ice."
  },
  "2755": {
    "description": "Get the Lightning Key from the attic above the Dojo of Lightning."
  },
  "2756": {
    "description": "Get the Fire Key from the attic above the Dojo of Fire."
  },
  "2757": {
    "description": "Vance Bulwark wants you to equip the Trial Faction Gear."
  },
  "2758": {
    "description": "Find Skeleton Camp Cruelskull on the Ninjago Battlefield."
  },
  "2759": {
    "description": "Find Skeleton Camp Ribspreader on the Ninjago Battlefield."
  },
  "2760": {
    "description": "Find Skeleton Camp Knucklemuck on the Ninjago Battlefield."
  },
  "2761": {
    "description": "Find Skeleton Camp Marshmallow on the Ninjago Battlefield."
  },
  "2762": {
    "description": "Equip all 3 pieces of the Lightning Ninja kit and show Jay."
  },
  "2763": {
    "description": "Return to Sensei Wu in the Ninjago Monastery."
  },
  "2764": {
    "description": "Look for the blue banners in the Ninjago Caves and find the Lightning Shrine."
  },
  "2765": {
    "description": "Smash Skeleton Mad Scientists in the Ninjago Caves until you retrieve the 3 pages of the Skull-a-Ton Building Instructions."
  },
  "2766": {
    "description": "Speak to Zane in the Monastery Dojo of Ice. Follow the light blue banners to find him."
  },
  "2768": {
    "description": "Return to Zane in the Monastery Dojo of Ice."
  },
  "2769": {
    "description": "Equip all 3 pieces of the Ice Ninja kit and show Zane."
  },
  "2770": {
    "description": "Return to Sensei Wu in the Ninjago Monastery."
  },
  "2771": {
    "description": "Speak to Kai in the Monastery Dojo of Fire. Follow the red banners to find him."
  },
  "2772": {
    "description": "Equip all 3 pieces of the Fire Ninja kit and show Kai."
  },
  "2773": {
    "description": "Return to Sensei Wu in the Ninjago Monastery."
  },
  "2774": {
    "description": "Look for the red Dragon Statue in the Ninjago Caves to find the Fire Shrine."
  },
  "2777": {
    "description": "Use all 9 of the binoculars around Ninjago."
  },
  "2778": {
    "description": "Read all 7 of the Story Plaques around Ninjago."
  },
  "2779": {
    "description": "Quick Build 5 Dragon-in-a-Boxes on the Ninjago Battlefield."
  },
  "2780": {
    "description": "Quick Build 25 more Dragon-in-a-Boxes on the Ninjago Battlefield."
  },
  "2781": {
    "description": "Quick Build 75 more Dragon-in-a-Boxes on the Ninjago Battlefield."
  },
  "2782": {
    "description": "Quick Build 5 Skeleton Bouncers on the Ninjago Battlefield."
  },
  "2783": {
    "description": "Quick Build 25 more Skeleton Bouncers on the Ninjago Battlefield."
  },
  "2784": {
    "description": "Quick Build 75 more Skeleton Bouncers on the Ninjago Battlefield."
  },
  "2785": {
    "description": "Quick Build 75 more Archery Targets on the Ninjago Battlefield."
  },
  "2786": {
    "description": "Quick Build 75 more Catapults on the Ninjago Battlefield."
  },
  "2787": {
    "description": "Smash 5 Skeleton Coffins on the Ninjago Battlefield or in the Ninjago Caves."
  },
  "2788": {
    "description": "Smash 25 more Skeleton Coffins on the Ninjago Battlefield or in the Ninjago Caves."
  },
  "2789": {
    "description": "Smash 75 more Skeleton Coffins on the Ninjago Battlefield or in the Ninjago Caves."
  },
  "2790": {
    "description": "Smash 10 Skeletons of any type in Ninjago."
  },
  "2791": {
    "description": "Smash 50 more Skeletons of any type  in Ninjago."
  },
  "2792": {
    "description": "Smash 100 more Skeletons of any type  in Ninjago."
  },
  "2793": {
    "description": "Smash 200 more Skeletons of any type  in Ninjago."
  },
  "2794": {
    "description": "Smash 10 Bone Wolves in the Ninjago Caves."
  },
  "2795": {
    "description": "Smash 50 more Bone Wolves in the Ninjago Caves."
  },
  "2796": {
    "description": "Smash 100 more Bone Wolves in the Ninjago Caves."
  },
  "2813": {
    "description": "Discover the Ninjago Battlefield."
  },
  "2814": {
    "description": "Discover the Ninjago Caves."
  },
  "2815": {
    "description": "Discover the Earth Shrine in the caves below the Ninjago Monastery."
  }
}
