{
  "2816": {
    "description": "Recover the 4 Weapons of Spinjitzu."
  },
  "2817": {
    "description": "Tame the Earth Dragon pet."
  },
  "2818": {
    "description": "Smash 25 Elemental Flowers around the Ninjago Monastery."
  },
  "2819": {
    "description": "Smash 75 more Elemental Flowers around the Ninjago Monastery."
  },
  "2820": {
    "description": "Smash 150 more Elemental Flowers around the Ninjago Monastery."
  },
  "2821": {
    "description": "Smash 250 more Elemental Flowers around the Ninjago Monastery."
  },
  "2822": {
    "description": "Smash 25 Bamboo Stalks around the Ninjago Monastery."
  },
  "2823": {
    "description": "Smash 75 more Bamboo Stalks around the Ninjago Monastery."
  },
  "2824": {
    "description": "Smash 150 more Bamboo Stalks around the Ninjago Monastery."
  },
  "2825": {
    "description": "Smash 250 more Bamboo Stalks around the Ninjago Monastery."
  },
  "2827": {
    "description": "Craft any 5 of Johnny Umami's special recipes."
  },
  "2828": {
    "description": "Craft 15 more of any of Johnny Umami's special recipes."
  },
  "2829": {
    "description": "Craft 50 of any of Johnny Umami's special recipes."
  },
  "2830": {
    "description": "Craft 125 of any of Johnny Umami's special recipes."
  },
  "2831": {
    "description": "Smash Chopov and retrieve the Scythe of Quakes."
  },
  "2832": {
    "description": "Smash Krazi and retrieve the Nunchuks of Lightning."
  },
  "2833": {
    "description": "Smash Bonezai and retrieve the Shurikens of Ice."
  },
  "2834": {
    "description": "Smash Frakjaw and retrieve the Sword of Fire."
  },
  "2835": {
    "description": "Smash Chopov in the Earth Shrine until he drops a Maelstrom Dark Blade."
  },
  "2836": {
    "description": "Smash Krazi in the Lightning Shrine until he drops a Maelstrom Bone."
  },
  "2837": {
    "description": "Smash Skeleton Commandos on the Ninjago Battlefield until you retrieve a Maelstrom Bone Axe."
  },
  "2838": {
    "description": "Smash Skeleton Blacksmiths on the Ninjago Battlefield until you retrieve a Maelstrom Blacksmith's Hammer."
  },
  "2839": {
    "description": "Smash Skeleton Raiders in the Ninjago Caves until you find a Maelstrom Double Bone Dagger."
  },
  "2840": {
    "description": "Smash Frakjaw in the Fire Shrine until he drops his Maelstrom Mace."
  },
  "2841": {
    "description": "Smash Skeleton Overseers in the Siege Towers until you retrieve a Maelstrom Double-Bladed Axe."
  },
  "2842": {
    "description": "Smash 10 Skeleton Troopers on the Ninjago Battlefield."
  },
  "2843": {
    "description": "Smash 3 Skeleton Commandos on the Ninjago Battlefield."
  },
  "2844": {
    "description": "Smash 8 Skeleton Blacksmiths on the Ninjago Battlefield."
  },
  "2845": {
    "description": "Smash 3 Skeleton Marksmen on the Ninjago Battlefield."
  },
  "2846": {
    "description": "Smash 4 Skeleton Raiders in the Ninjago Caves."
  },
  "2847": {
    "description": "Smash 2 Bone Wolves in the Ninjago Caves."
  },
  "2848": {
    "description": "Smash 4 Skeleton Mad Scientists in the Ninjago Caves."
  },
  "2849": {
    "description": "Smash 2 Bone Wolves in the Ninjago Caves."
  },
  "2850": {
    "description": "Smash 10 Skeleton Coffins on the Ninjago Battlefield."
  },
  "2851": {
    "description": "Smash 1 Skeleton Siege Tower on the Ninjago Battlefield."
  },
  "2852": {
    "description": "Smash 4 Skeleton Siege Shields on the Ninjago Battlefield and rebuild them into Archery Targets."
  },
  "2853": {
    "description": "Smash 3 Maelstrom Weapon Crates on the Ninjago Battlefield and rebuild them into Dragon-in-the-Boxes."
  },
  "2854": {
    "description": "Smash and rebuild 2 Skeleton Catapults on the Ninjago Battlefield."
  },
  "2855": {
    "description": "Smash 5 Skeleton Ladders on the Ninjago Battlefield and rebuild them into Bouncers."
  },
  "2856": {
    "description": "Smash 5 Lightning Blossoms in the Ninjago Monastery."
  },
  "2857": {
    "description": "Smash 5 Fire Blossoms in the Ninjago Monastery."
  },
  "2858": {
    "description": "Smash 5 Bamboo Stalks in the Ninjago Monastery."
  },
  "2859": {
    "description": "Smash 5 Ice Blossoms in the Ninjago Monastery."
  },
  "2860": {
    "description": "Smash 5 Earth Blossoms in the Ninjago Monastery."
  },
  "2861": {
    "description": "Smash 5 Bamboo Stalks in the Ninjago Monastery."
  },
  "2862": {
    "description": "Toshiro Gojira, the Monastery Guard, wants a Dirt Sandwich from Johnny Umami."
  },
  "2863": {
    "description": "Toshiro Gojira, the Monastery Guard, wants a Chilly Freezesteak from Johnny Umami."
  },
  "2864": {
    "description": "Hari Howzen, the Guard in the Ninjago Caves, wants 1 Yucki-Yaki from Johnny Umami."
  },
  "2865": {
    "description": "Hari Howzen, the Guard in the Ninjago Caves, wants 2 Bento Blocks from Johnny Umami."
  },
  "2866": {
    "description": "Rescue all 6 captured Villagers in the Ninjago Caves."
  },
  "2867": {
    "description": "Collect the Dragon Relic of Earth from the Earth Garden in the Monastery."
  },
  "2868": {
    "description": "Collect the Dragon Relic of Lightning from the Lightning Garden in the Monastery."
  },
  "2869": {
    "description": "Collect the Dragon Relic of Ice from the Ice Garden in the Monastery."
  },
  "2870": {
    "description": "Collect the Dragon Relic of Fire from the Fire Garden in the Monastery."
  },
  "2871": {
    "description": "Discover the center courtyard of the Ninjago Monastery."
  },
  "2872": {
    "description": "Discover the Dojo of Earth in Ninjago."
  },
  "2873": {
    "description": "Discover the Dojo of Lightning in Ninjago."
  },
  "2874": {
    "description": "Discover the Dojo of Ice in Ninjago."
  },
  "2875": {
    "description": "Discover the Dojo of Fire in Ninjago."
  },
  "2876": {
    "description": "Discover the Ninjago Storeroom."
  },
  "2877": {
    "description": "Discover the Cave of Ancient Ways."
  },
  "2878": {
    "description": "Discover the Cave of Black Echoes."
  },
  "2879": {
    "description": "Discover the Cave of White Whispers."
  },
  "2880": {
    "description": "Discover the Ice Shrine in the caves below the Ninjago Monastery."
  },
  "2881": {
    "description": "Discover the Lightning Shrine in the caves below the Ninjago Monastery."
  },
  "2882": {
    "description": "Discover the Fire Shrine in the caves below the Ninjago Monastery."
  },
  "2883": {
    "description": "Learn to use Earth Spinjitzu Lanterns and burrow into the earth!"
  },
  "2884": {
    "description": "Learn to use Lightning Spinjitzu Lanterns and zap across sheer drops!"
  },
  "2885": {
    "description": "Learn to use Ice Spinjitzu Lanterns and smash boulders of ice!"
  },
  "2886": {
    "description": "Learn to use Fire Spinjitzu Lanterns and blast up into the air!"
  },
  "2905": {
    "description": "Use the Earth Key to open the treasure chest in front of Cole."
  },
  "2906": {
    "description": "Use the Lightning Key to open the treasure chest in front of Jay."
  },
  "2907": {
    "description": "Use the Ice Key to open the treasure chest in front of Zane."
  },
  "2908": {
    "description": "Use the Fire Key to open the treasure chest in front of Kai."
  },
  "2913": {
    "description": "Quick Build 5 Archery Targets on the Ninjago Battlefield."
  },
  "2914": {
    "description": "Quick Build 25 more Archery Targets on the Ninjago Battlefield."
  },
  "2915": {
    "description": "Quick Build 5 Catapults on the Ninjago Battlefield."
  },
  "2916": {
    "description": "Buy the Ki Filled Hood from Tomoko Moonstone in the Ninjago Monastery."
  },
  "2917": {
    "description": "Equip the Ki Filled Hood you bought from Tomoko Moonstone."
  },
  "2918": {
    "description": "Interact with the Earth Spinjitzu Lantern near Cole in the Dojo of Earth to use its power."
  },
  "2919": {
    "description": "Quick Build 25 more Catapults on the Ninjago Battlefield."
  },
  "2920": {
    "description": "Talk to Kodo Pandaheart, one of the Guards outside the Monastery Gates."
  },
  "2921": {
    "description": "Talk to Cole in the Monastery Dojo of Earth."
  },
  "2922": {
    "description": "Fly to Nexus Tower and speak to Nexus Naomi about the Nexus Force Championships."
  },
  "2923": {
    "description": "Use the Speedchat menu in the lower left to perform a Cheer for Nexus Naomi!"
  }
}
