{
  "10": {
    "storyTitle": "Did You Know?",
    "text": "When double-jumping, time your 2nd jump carefully to get the greatest distance."
  },
  "106": {
    "storyTitle": "Did You Know?",
    "text": "Having trouble finding your way? Binoculars may show you a clue. Have a look!"
  },
  "107": {
    "storyTitle": "The Battle of Crux Prime",
    "text": "The Maelstrom is trying to attack Nexus Tower! Speak to Duke Exeter in the Sentinel Command Center to join the battle!"
  },
  "11": {
    "storyTitle": "Did You Know?",
    "text": "If you get stuck, you can smash yourself by clicking the ? icon, and then the life preserver icon."
  },
  "112": {
    "storyTitle": "Valiant Weapons!",
    "text": "The Nexus Force has created powerful two-handed weapons! See your Faction Vendor in Nexus Tower!"
  },
  "12": {
    "storyTitle": "Did You Know?",
    "text": "Help can be found by clicking the ? icon."
  },
  "122": {
    "storyTitle": "New Faction Kits!",
    "text": "New Faction Kits are here! Check Nimbus Station and Nexus Tower to find out what the Factions have created!"
  },
  "124": {
    "storyTitle": "Fly to Nexus Tower!",
    "text": "Nexus Tower: Home of the Nexus Force. Safeguard of the Imagination Nexus. And the center of LEGO Universe!"
  },
  "125": {
    "storyTitle": "Level Up to 45!",
    "text": "Now you can increase your Minifigure's Level to 45! Complete Missions and Achievements to earn U-Score!"
  },
  "126": {
    "storyTitle": "The Commendation Vendor",
    "text": "Have you deleted a mission or achievement reward? Visit Honor Accolade in Nexus Tower to buy them back!"
  },
  "127": {
    "storyTitle": "Treehouse and Space Fort!",
    "text": "Buy these Model Sets from Kirsten Quasar or Eekums the Monkey at the Avant Gardens Launch Area!"
  },
  "128": {
    "storyTitle": "Battle for Ninjago!",
    "text": "An all-new Ninjago world has appeared in LEGO Universe! Fly there from the launcher at Nexus Tower!"
  },
  "129": {
    "storyTitle": "Have Your Cape and Wear It Too!",
    "text": "Every Minifigure looks more heroic with a cape! Reach Level 30 to buy Capes, and reach Level 40 to get the Valiant Capes!"
  },
  "13": {
    "storyTitle": "Did You Know?",
    "text": "You can collect models and bricks to build amazing creations on your Property."
  },
  "130": {
    "storyTitle": "Battle the Spider Queen!",
    "text": "Fight this Maelstrom monster when you claim your Block Yard Property! Then explore the new Spider Caves to fight her again!"
  },
  "131": {
    "storyTitle": "New Ninjago Model Sets!",
    "text": "Find the new Ninjago Monastery and Skeleton Outpost Sets on Ninjago!"
  },
  "133": {
    "storyTitle": "Unleash Spinjitzu!",
    "text": "Protect the Weapons of Spinjitzu from the Skeletons and unleash the powers of Earth, Lightning, Ice and Fire!"
  },
  "134": {
    "storyTitle": "Are you a Nexus Force Champion?",
    "text": "Calling all Builders, Battlers and Racers! Get ready for the Nexus Force Championships!"
  },
  "14": {
    "storyTitle": "Did You Know?",
    "text": "Find the hidden Story Plaques spread throughout each world."
  },
  "15": {
    "storyTitle": "Did You Know?",
    "text": "Check your Passport for information on Missions and Achievements - and the rewards you'll receive from completing them!"
  },
  "16": {
    "storyTitle": "Did You Know?",
    "text": "Each world in LEGO Universe has hidden collectibles. Find them all for rewards like extra Life Points."
  },
  "18": {
    "storyTitle": "Did You Know?",
    "text": "Did you know you can join a Faction in Nimbus Station?"
  },
  "19": {
    "storyTitle": "Did You Know?",
    "text": "Challenge your friends at the Vertigo Loop racetrack in Nimbus Station."
  },
  "20": {
    "storyTitle": "Did You Know?",
    "text": "Double-Jump by tapping the spacebar twice."
  },
  "21": {
    "storyTitle": "Did You Know?",
    "text": "Hold the right mouse button down to move your camera around and view things from a different angle."
  },
  "22": {
    "storyTitle": "Did You Know?",
    "text": "You can unlock more Backpack space in Nimbus Station."
  },
  "23": {
    "storyTitle": "Did You Know?",
    "text": "More words are constantly being added to the Chat System's whitelist."
  },
  "24": {
    "storyTitle": "Did You Know?",
    "text": "Joining a Faction unlocks the ability to wear Specialty Kit gear."
  },
  "26": {
    "storyTitle": "Did You Know?",
    "text": "The Venture League Faction offers Specialties such as the Buccaneer and the Daredevil."
  },
  "28": {
    "storyTitle": "Did You Know?",
    "text": "The Sentinel Faction offers Specialties such as the Knight and the Samurai."
  },
  "29": {
    "storyTitle": "Did You Know?",
    "text": "The Paradox Faction offers Specialties such as the Sorcerer and the Space Marauder."
  },
  "30": {
    "storyTitle": "Did You Know?",
    "text": "The Assembly Faction offers Specialties such as the Engineer and the Summoner."
  },
  "31": {
    "storyTitle": "Did You Know?",
    "text": "Collect Faction Tokens to purchase Specialty Kit gear and unlock higher ranks in your Specialties."
  },
  "32": {
    "storyTitle": "Did You Know?",
    "text": "Join the Nexus Force and help them defend the Universe from the evil Maelstrom! Find the Nexus Force Recruiter in Nimbus Station."
  },
  "36": {
    "storyTitle": "Did You Know?",
    "text": "Unlock Ranks 2 and 3 of your Specialty Kits by collecting all of the pieces of gear from the previous Rank."
  },
  "37": {
    "storyTitle": "Did You Know?",
    "text": "Interact with the Tiki Torches in Gnarled Forest - they spit out Imagination power-ups!"
  },
  "38": {
    "storyTitle": "Did You Know?",
    "text": "Unlock extra Imagination Points by finding the Imagination Bricks hidden throughout the Universe!"
  },
  "39": {
    "storyTitle": "Did You Know?",
    "text": "Unlock extra Life Points by collecting sets of Flags hidden throughout the Universe!"
  },
  "40": {
    "storyTitle": "Did You Know?",
    "text": "As a Daredevil, you will be able to pull off extreme stunts as you defeat the Maelstrom. Join the Venture League to become a Daredevil!"
  },
  "42": {
    "storyTitle": "Did You Know?",
    "text": "As an Engineer, you will build clever devices to defeat your enemies and assist your allies. Join Assembly to become an Engineer!"
  },
  "43": {
    "storyTitle": "Did You Know?",
    "text": "As a Knight, your superior armor and battle skills will help you defeat your enemies in close combat. Join the Sentinel Faction to become a Knight!"
  },
  "44": {
    "storyTitle": "Did You Know?",
    "text": "As a Samurai, your strength and skill with sword and bow will allow you to vanquish the forces of the Maelstrom. Join the Sentinel Faction to become a Samurai!"
  },
  "45": {
    "storyTitle": "Did You Know?",
    "text": "As a Sorcerer, you will bend the forces of the Maelstrom to your will through massive blasts of energy. Join Paradox to become a Sorcerer!"
  },
  "46": {
    "storyTitle": "Did You Know?",
    "text": "As a Space Marauder, you will use powerful Maelstrom-based weaponry to defeat your opponents. Join Paradox to become a Space Marauder!"
  },
  "47": {
    "storyTitle": "Did You Know?",
    "text": "As a Summoner, you will conjure strange and loyal creatures to attack and defeat your foes. Join Assembly to become a Summoner!"
  },
  "48": {
    "storyTitle": "Did You Know?",
    "text": "As a Buccaneer, you will use swashbuckling moves and derring-do to smash your foes. Join the Venture League to become a Buccaneer!"
  },
  "5": {
    "storyTitle": "Did You Know?",
    "text": "When double-jumping, time your second jump carefully to get the greatest distance."
  },
  "53": {
    "storyTitle": "Did You Know?",
    "text": "Getting smashed by enemies too much? Buy better gear from your Faction Vendor!"
  },
  "54": {
    "storyTitle": "Did You Know?",
    "text": "Heading into Forbidden Valley? Rank 2 Faction gear is highly recommended!"
  },
  "55": {
    "storyTitle": "Did You Know?",
    "text": "Are you falling off of cliffs too often? Remember to use the right mouse button to move your camera."
  },
  "56": {
    "storyTitle": "Did You Know?",
    "text": "Have you equipped some new gear? Check your Action Bar for new skills."
  },
  "57": {
    "storyTitle": "Did You Know?",
    "text": "Are you crashing on those tight turns in racing? Try using SHIFT to drift your car."
  },
  "58": {
    "storyTitle": "Did You Know?",
    "text": "Feeling overwhelmed by the Maelstrom? Check your Action Bar for skills that can help you in combat!"
  },
  "6": {
    "storyTitle": "Did You Know?",
    "text": "Some weapons have charge-up attacks. Hold down the Attack key to charge up!"
  },
  "60": {
    "storyTitle": "Did You Know?",
    "text": "Have you tried Speedchat? Click the Speedchat icon in the lower left of the screen."
  },
  "61": {
    "storyTitle": "Did You Know?",
    "text": "Once you join a Faction, you can collect all Specialty Kits for that Faction, not just the one you start with."
  },
  "63": {
    "storyTitle": "Did You Know?",
    "text": "Be sure to stock up on Supplies before you head into battle!"
  },
  "65": {
    "storyTitle": "Did You Know?",
    "text": "Need more room in your Backpack? Check your Passport for Missions and Achievements that give you more space."
  },
  "66": {
    "storyTitle": "Did You Know?",
    "text": "How many different Rockets have you built? The sky is the limit!"
  },
  "68": {
    "storyTitle": "Did You Know?",
    "text": "How many different Race Cars have you built? Customize your ride!\r\nHow many different Modular Race Cars have you built? Customize your ride!"
  },
  "69": {
    "storyTitle": "Did You Know?",
    "text": "Once you join a Faction, you can collect Faction Tokens by smashing and building."
  },
  "7": {
    "storyTitle": "Did You Know?",
    "text": "When on a Mission, click the round icon at the top of the screen to review the current Mission task."
  },
  "70": {
    "storyTitle": "Did You Know?",
    "text": "You can accept more than one Mission at a time. Click the arrows at the top of your screen to view your current Missions."
  },
  "71": {
    "storyTitle": "Did You Know?",
    "text": "Have you checked your mail lately? Look for mailboxes throughout LEGO Universe."
  },
  "72": {
    "storyTitle": "Did You Know?",
    "text": "Want to race against other players? The Vertigo Loop racetrack in Nimbus Station is a great place to start."
  },
  "73": {
    "storyTitle": "Did You Know?",
    "text": "Find the Pirate Hook in Gnarled Forest to race at the Keelhaul Canyon racetrack! Don’t forget to build a car first!"
  },
  "75": {
    "storyTitle": "Did You Know?",
    "text": "How many Properties have you claimed?"
  },
  "76": {
    "storyTitle": "Did You Know?",
    "text": "Use the Property Console to name your Property, write a description, allow visitors, and view your Property’s Reputation."
  },
  "77": {
    "storyTitle": "Did You Know?",
    "text": "You can trade unlinked items, coins and bricks with any other player. Just move close, hit the CTRL key, and choose 'Ask to Trade with Me' from the drop-down menu."
  },
  "78": {
    "storyTitle": "Did You Know?",
    "text": "When you equip an item, it becomes Linked to your Minifigure, and cannot be traded. Items from Achievements and Missions are automatically Linked."
  },
  "8": {
    "storyTitle": "Did You Know?",
    "text": "Check your Passport regularly to find new Achievements to tackle!"
  },
  "80": {
    "storyTitle": "Did You Know?",
    "text": "When your Minifigure is smashed, you lose some of your coins. You can usually get them back - but not if you fall in the water!"
  },
  "81": {
    "storyTitle": "Did You Know?",
    "text": "Linked items cannot be traded. Try selling them to a Vendor instead of throwing them away. Bricks, coins, and Supplies never become Linked."
  },
  "82": {
    "storyTitle": "Did You Know?",
    "text": "To visit the LEGO Club, you must first join the LEGO Club at www.LEGO.com."
  },
  "83": {
    "storyTitle": "Did You Know?",
    "text": "Best Friends are players you already know in real life. Invite people on your Friends List to be Best Friends. Your parents will confirm this on the LEGO Universe web site."
  },
  "84": {
    "storyTitle": "Did You Know?",
    "text": "Best Friends can do extra things in the game! Best Friends can IM and Mail with Super Chat, which lets you say much more than regular chat."
  },
  "85": {
    "storyTitle": "Did You Know?",
    "text": "Best Friends can play on each other’s Properties, even when the Mythrans haven’t approved everything. Your Best Friends can even watch you build!"
  },
  "87": {
    "storyTitle": "Did You Know?",
    "text": "Play each of the Red Blocks concert instruments for 30 seconds and you will unlock more Backpack space!"
  },
  "89": {
    "storyTitle": "Did You Know?",
    "text": "Smash 500 enemies to unlock more Backpack space!"
  },
  "9": {
    "storyTitle": "Did You Know?",
    "text": "You can last longer in the Survival mini-game if you play with friends!"
  },
  "90": {
    "storyTitle": "Did You Know?",
    "text": "Discover all 3 paths up the Monument to unlock more Backpack space!"
  },
  "91": {
    "storyTitle": "Did You Know?",
    "text": "Collect enough Bananas in Gnarled Forest and you will unlock more Backpack space!"
  },
  "92": {
    "storyTitle": "Did You Know?",
    "text": "Use all 9 binoculars in Avant Gardens to unlock more Backpack space!"
  }
}
