{
  "10": {
    "tip1": "Torch the competition on the most dangerous and challenging racetrack yet!",
    "tip2": "Look for the Race Place in Forbidden Valley!",
    "title": "Race Through Dragonmaw Chasm!"
  },
  "11": {
    "tip1": "The Nexus Force has created powerful two-handed weapons!",
    "tip2": "See your Faction Vendor in Nexus Tower!",
    "title": "Valiant Weapons!"
  },
  "12": {
    "tip1": "Show your Faction Pride in these Faction Race Cars and Rockets!",
    "tip2": "See your Faction Vendor in Nimbus Station!",
    "title": "Show Your Faction Pride!"
  },
  "13": {
    "tip1": "You can smash yourself and rebuild at a nearby safe spot!",
    "tip2": "Just select the Help Menu and then select the Smash option!",
    "title": "Are You Trapped?"
  },
  "14": {
    "tip1": "Many weapons have charge-up attacks and effects.",
    "tip2": "Hold down the Attack key to charge up, then release it!",
    "title": "Charge!"
  },
  "15": {
    "tip1": "Click the round icon at the top of the screen to review your current Mission.",
    "tip2": "Click the arrows on either side of the icon to review all of your Missions!",
    "title": "Mission Control"
  },
  "16": {
    "tip1": "Check your Passport regularly to find new Achievements to tackle!",
    "tip2": "There are different Achievements on each tab of the Passport.",
    "title": "Are You an Achiever?"
  },
  "17": {
    "tip1": "Each world in LEGO Universe has hidden Heart Flags or Backpack Flags.",
    "tip2": "Find all Flags on each world to earn more Life or Backpack space.",
    "title": "More Life! Larger Backpacks!"
  },
  "19": {
    "tip1": "Look for mailboxes around LEGO Universe to send or receive mail!",
    "tip2": "Sometimes you'll find items attached to the mail you get!",
    "title": "Got Mail?"
  },
  "20": {
    "tip1": "Travel back in time and defend Nimbus Station from a Maelstrom invasion!",
    "tip2": "Fight through the waves of enemies as quickly as you can!",
    "title": "The Battle of Nimbus Station"
  },
  "21": {
    "tip1": "These are exciting LEGO Universe worlds created by LEGO fans!",
    "tip2": "You will be returned to Starbase 3001 if your computer has difficulty loading this world.",
    "title": "Blast off to the World Builder Planets!"
  },
  "22": {
    "tip1": "These are exciting LEGO Universe worlds created by LEGO fans!",
    "tip2": "You will be returned to Starbase 3001 if your computer has difficulty loading this world.",
    "title": "Blast off to the World Builder Planets!"
  },
  "23": {
    "tip1": "These are exciting LEGO Universe worlds created by LEGO fans!",
    "tip2": "You will be returned to Starbase 3001 if your computer has difficulty loading this world.",
    "title": "Blast off to the World Builder Planets!"
  },
  "24": {
    "tip1": "Get inspired and build on Nimbus Station's largest Property!",
    "tip2": "Look for the launchpad by the water's edge in Brick Annex!",
    "title": "Build on Nimbus Isle!"
  },
  "25": {
    "tip1": "Place your tamed Pets on any of your Properties!",
    "tip2": "Use Behaviors on your Pets to create stories and adventures for others to enjoy!",
    "title": "Pets on Property!"
  },
  "26": {
    "tip1": "Create a wild Property adventure with the Zoo and Safari Model Sets!",
    "tip2": "Head to Nimbus Station and buy them from Autumn Helix in Brick Annex!",
    "title": "Animal Adventures!"
  },
  "27": {
    "tip1": "Nexus Tower protects the Imagination Nexus - the last pure source of Imagination!",
    "tip2": "Nexus Tower is also home to the Nexus Force - go there to meet the Faction Leaders!",
    "title": "Fly to Nexus Tower!"
  },
  "28": {
    "tip1": "Become an Adventurer, Shinobi, Inventor or Space Ranger!",
    "tip2": "Check with your Faction Vendor in Nimbus Station or Nexus Tower!",
    "title": "New Faction Kits!"
  },
  "29": {
    "tip1": "These are exciting LEGO Universe worlds created by LEGO fans!",
    "tip2": "You will be returned to Starbase 3001 if your computer has difficulty loading this world.",
    "title": "Blast off to the World Builder Planets!"
  },
  "30": {
    "tip1": "Collect U-Score by completing Missions and Achievements and you'll increase your Level!",
    "tip2": "Your LEGO Universe Level unlocks better gear and rewards!",
    "title": "Level Up!"
  },
  "31": {
    "tip1": "Build on your Property with the Treehouse and Space Fort Model Sets!",
    "tip2": "Buy them from Kirsten Quasar and Eekums the Monkey at the Avant Gardens Launch Area!",
    "title": "Check Out These Models!"
  },
  "32": {
    "tip1": "An all-new Ninjago world has appeared in LEGO Universe!",
    "tip2": "Fly to Ninjago from a launcher at Nexus Tower!",
    "title": "Battle for Ninjago!"
  },
  "33": {
    "tip1": "Check the clothing and Faction vendors in Nexus Tower and Nimbus Station once you've leveled up!",
    "tip2": "Check the clothing and Faction vendors in Nexus Tower and Nimbus Station once you've levelled up!",
    "title": "Have Your Cape and Wear It Too!"
  },
  "34": {
    "tip1": "Confront this Maelstrom monster when you claim your Block Yard Property!",
    "tip2": "Then smash her again in a Battle Instance! Look in the new Spider Cave to join up!",
    "title": "Battle the Spider Queen!"
  },
  "35": {
    "tip1": "Be a part of the LEGO Universe community! Share stories, ask questions and more!",
    "tip2": "Go to www.legouniverse.com, click Community and then Message Board!",
    "title": "Visit the LEGO Universe Forums!"
  },
  "36": {
    "tip1": "Check out the new Ninjago Monastery and Skeleton Outpost Sets!",
    "tip2": "Fly to Ninjago and visit Bubu Mumu for the Monastery Set, or smash Skeletons for the Outpost Set!",
    "title": "New Ninjago Model Sets!"
  },
  "37": {
    "tip1": "The Skeletons are trying to get their bony hands on the Weapons of Spinjitzu!",
    "tip2": "Fly to Ninjago and find the Weapons to unleash Earth, Lightning, Ice and Fire Spinjitzu!",
    "title": "Protect the Weapons of Spinjitzu!"
  },
  "38": {
    "tip1": "Frostburgh's comet has completed another trip around the Universe!",
    "tip2": "Get ready for more winter fun, holiday items and snowball fights!",
    "title": "Frostburgh Returns!"
  },
  "39": {
    "tip1": "Lord Garmadon is trying to invade the Ninjago Fire Temple!",
    "tip2": "Will you have what it takes to survive its challenges - and defeat Lord Garmadon?",
    "title": "The Fire Temple Awaits!"
  },
  "4": {
    "tip1": "Are you powerful enough to fight off the Maelstrom on Crux Prime?",
    "tip2": "Blast off for battle from the Crux Prime launch bay in Nexus Tower!",
    "title": "Defend Nexus Tower!"
  },
  "40": {
    "tip1": "The Nexus Force Championships will test the best builders, battlers and racers!",
    "tip2": "Are you ready to represent your Faction and win the grand prize?",
    "title": "Are you a Nexus Force Champion?"
  },
  "41": {
    "tip1": "Now you can collect enough Universe Score to reach Level 45!",
    "tip2": "You'll start off with more Life and Imagination when you respawn!",
    "title": "Level 45!"
  },
  "6": {
    "tip1": "Have you collected these Rank 3 Kits?",
    "tip2": "Find Faction Tokens by battling, racing or completing Daily Missions!",
    "title": "Battle in Style!"
  },
  "7": {
    "tip1": "Travel back in time and defend Nimbus Station!",
    "tip2": "Team up and find Wenn Wuzzit in Nimbus Station to join the fight!",
    "title": "Battle in the Past!"
  },
  "8": {
    "tip1": "Complete them to earn Model Sets!",
    "tip2": "Check the Build Tab in your Passport!",
    "title": "Build Achievements!"
  }
}
