{
  "2048": {
    "completion_succeed_tip": "Discover the Cave of Black Echoes!",
    "description": "Discover the Cave of Black Echoes."
  },
  "2049": {
    "completion_succeed_tip": "Discover the Cave of White Whispers!",
    "description": "Discover the Cave of White Whispers."
  },
  "2050": {
    "completion_succeed_tip": "Discover the Ice Shrine!",
    "description": "Discover the Ice Shrine in the caves below the Ninjago Monastery."
  },
  "2051": {
    "completion_succeed_tip": "Discover the Lightning Shrine!",
    "description": "Discover the Lightning Shrine in the caves below the Ninjago Monastery."
  },
  "2052": {
    "completion_succeed_tip": "Discover the Fire Shrine!",
    "description": "Discover the Fire Shrine in the caves below the Ninjago Monastery."
  },
  "2053": {
    "completion_succeed_tip": "Secrets of Earth Spinjitzu!",
    "description": "Learn to use Earth Spinjitzu Lanterns and burrow into the earth!"
  },
  "2054": {
    "completion_succeed_tip": "Secrets of Lightning Spinjitzu!",
    "description": "Learn to use Lightning Spinjitzu Lanterns and zap across sheer drops!"
  },
  "2055": {
    "completion_succeed_tip": "Secrets of Ice Spinjitzu!",
    "description": "Learn to use Ice Spinjitzu Lanterns and smash boulders of ice!"
  },
  "2056": {
    "completion_succeed_tip": "Secrets of Fire Spinjitzu!",
    "description": "Learn to use Fire Spinjitzu Lanterns and blast up into the air!"
  },
  "2068": {
    "completion_succeed_tip": "Fight in the Shade 1!",
    "description": "Quick Build 5 Archery Targets on the Ninjago Battlefield."
  },
  "2069": {
    "completion_succeed_tip": "Fight in the Shade 2!",
    "description": "Quick Build 25 more Archery Targets on the Ninjago Battlefield."
  },
  "2070": {
    "completion_succeed_tip": "Just a Fling 1!",
    "description": "Quick Build 5 Catapults on the Ninjago Battlefield."
  },
  "2071": {
    "accept_chat_bubble": "Tomoko Moonstone has a sister named Sakura. Have you met her on Crux Prime?",
    "chat_state_1": "You can't go out there dressed like that!",
    "chat_state_2": "Tomoko Moonstone sells clothing and gear from her cart in the central courtyard.",
    "chat_state_3": "If you want to fight like a Ninja, I suggest dressing like a Ninja!",
    "chat_state_4": "Tomoko Moonstone has a sister named Sakura. Have you met her on Crux Prime?",
    "completion_succeed_tip": "Return to Sensei Wu in the Ninjago Monastery.",
    "in_progress": "Buy a Ki Filled Hood from Tomoko Moonstone in the Ninjago Monastery and equip it.",
    "offer": "Your Nexus Force gear is weak against the Skeletons! Buy a Ki Filled Hood from Tomoko Moonstone, then equip it!",
    "ready_to_complete": "Now you will be safer when you battle the Skeletons. And safer still once you learn Spinjitzu! Ha!"
  },
  "2072": {
    "accept_chat_bubble": "Learn each form of Spinjitzu to use all 4 Lantern types!",
    "chat_state_1": "Spinjitzu isn't just for battling Skeletons!",
    "chat_state_2": "Learn each form of Spinjitzu to use all 4 Lantern types!",
    "chat_state_3": "Underground is the only way to get around!",
    "completion_succeed_tip": "Talk to Cole again in the Dojo of Earth.",
    "in_progress": "Interact with the Earth Spinjitzu Lantern near Cole in the Dojo of Earth to use its power.",
    "offer": "Before you can fight with Spinjitzu, you must learn to handle its power! Interact with the Earth Lantern over there to give it a try!",
    "ready_to_complete": "Rock solid! As you learn each form of Spinjitzu, you can use the other types of Lanterns as well!"
  },
  "2073": {
    "completion_succeed_tip": "Just a Fling 2!",
    "description": "Quick Build 25 more Catapults on the Ninjago Battlefield."
  },
  "2074": {
    "accept_chat_bubble": "Kodo and his brother Podo are stationed just outside the side entrances to the Monastery.",
    "chat_state_1": "You've faced the Maelstrom before? And it doesn't make you all dizzy?",
    "chat_state_2": "Kodo will have some missions for you out on the Battlefield, so be ready!",
    "chat_state_3_turnin": "What are you doing out here? This isn't a safe place to hang out!",
    "completion_succeed_tip": "Talk to Kodo Pandaheart, one of the Guards outside the Monastery Gates.",
    "in_progress": "Cole wants you to talk to Kodo Pandaheart, the Guard outside the Monastery Gates.",
    "offer": "Those Maelstrom Weapons make me woozy, but we still need to fight! See if you can help the guards out front!",
    "ready_to_complete": "Cole sent you? Good, we can use all the help we can get! It's a mess out here!"
  },
  "2075": {
    "accept_chat_bubble": "Hurry back inside and talk to Cole again! Follow the orange banners!",
    "chat_state_1": "There are more of your Nexus Force friends arriving every day!",
    "chat_state_2": "Cole is waiting for you inside the Dojo of Earth!",
    "chat_state_3_turnin": "You're back! Have a good time?",
    "completion_succeed_tip": "Talk to Cole in the Monastery Dojo of Earth.",
    "in_progress": "Return to Cole in the Monastery Dojo of Earth.",
    "offer": "Cole has some important Ninja business with you! Go see him and we'll keep holding the fort!",
    "ready_to_complete": "Ladders into Bouncers? Stone coffins? Wow, you were busy out there!"
  },
  "2076": {
    "accept_chat_bubble": "WANNA GET TO NEXUS TOWER? BECOME A MEMBER AND THEN BLAST OFF FROM NIMBUS STATION!",
    "chat_state_1": "SOMEONE AROUND HERE SMELLS LIKE COMPETITIVE SPIRIT! WHEW!!",
    "chat_state_2": "YOU'LL FIND NEXUS NAOMI IN NEXUS TOWER! LOOK FOR THE PRETTY LADY ALL IN BLUE!",
    "chat_state_3_turnin": "My sensors indicate that your sportsmanship readings are off the charts!",
    "completion_succeed_tip": "Talk to Nexus Naomi in the lobby of Nexus Tower.",
    "in_progress": "Fly to Nexus Tower and speak to Nexus Naomi about the Nexus Force Championships.",
    "offer": "Are you a competitor? Head to Nexus Tower and speak to Nexus Naomi about the Nexus Force Championships!",
    "ready_to_complete": "Whoa, you're full of competitive spirit! Ready to represent your Faction in the Championships?"
  },
  "2077": {
    "accept_chat_bubble": "Gimme a C! Gimme an H! Gimme an AMPIONSHIPS!",
    "chat_state_1": "Are you a jumping, racing, Maelstrom-smashing super athlete?!",
    "chat_state_2": "Click on the Speedchat icon in the lower left - then find the Cheer emote!",
    "chat_state_3": "You're almost as excited as I am!",
    "completion_succeed_tip": "Talk to Nexus Naomi again.",
    "in_progress": "Use the Speedchat menu in the lower left to perform a Cheer for Nexus Naomi!",
    "offer": "We're hosting a special event this fall - the Nexus Force Championships! Use Speedchat to give me your best Nexus Force cheer!",
    "ready_to_complete": "Read more about the Nexus Force Championships on the Community page at www.LEGOuniverse.com!"
  }
}
