{
  "0": {
    "FailureReason": "You must equip your Pirate Hook!"
  },
  "100": {
    "FailureReason": "Player already has item in inventory"
  },
  "101": {
    "FailureReason": "Player already has item in inventory"
  },
  "102": {
    "FailureReason": "Player already has item in inventory"
  },
  "103": {
    "FailureReason": "Player already has item in inventory"
  },
  "104": {
    "FailureReason": "Check with the Dojo Master."
  },
  "105": {
    "FailureReason": "Check with the Dojo Master."
  },
  "106": {
    "FailureReason": "You must complete all missions for Brickmaster Clang to unlock this race."
  },
  "107": {
    "FailureReason": "You must build your Rocket before you can launch."
  },
  "108": {
    "FailureReason": "Faction members only. Find the Recruiter in Nimbus Station and join a Faction!"
  },
  "109": {
    "FailureReason": "Talk to Bella Pepper on Pet Cove."
  },
  "110": {
    "FailureReason": "You can only use this in certain Build Modes."
  },
  "111": {
    "FailureReason": "Drag a Rocket onto the launch pad to visit property worlds."
  },
  "112": {
    "FailureReason": "Talk to the Property Guard first."
  },
  "113": {
    "FailureReason": "You must unlock Behaviors on the Block Yard Property in Avant Gardens first."
  },
  "114": {
    "FailureReason": "You must clear the Nimbus Rock Property in Nimbus Station first."
  },
  "115": {
    "FailureReason": "You must clear the Chantey Shanty Property in Gnarled Forest first."
  },
  "117": {
    "FailureReason": "Use the Rank 1 Engineer book before doing that."
  },
  "118": {
    "FailureReason": "Use the Rank 1 Summoner book before doing that."
  },
  "119": {
    "FailureReason": "Use the Rank 1 Buccaneer book before doing that."
  },
  "120": {
    "FailureReason": "Use the Rank 1 Daredevil book before doing that."
  },
  "121": {
    "FailureReason": "Use the Rank 1 Knight book before doing that."
  },
  "122": {
    "FailureReason": "Use the Rank 1 Samurai book before doing that."
  },
  "123": {
    "FailureReason": "Use the Rank 1 Sorcerer book before doing that."
  },
  "124": {
    "FailureReason": "Use the Rank 1 Space Marauder book before doing that."
  },
  "125": {
    "FailureReason": "Talk to Velocity Lane in Nimbus Station to unlock this race."
  },
  "126": {
    "FailureReason": "Talk to Velocity Lane in Nimbus Station to unlock this race."
  },
  "127": {
    "FailureReason": "Talk to Bob to receive your next mission."
  },
  "128": {
    "FailureReason": "Talk to Sky Lane to receive your next Mission."
  },
  "129": {
    "FailureReason": "You need to lease the Nimbus Rock property to use this."
  },
  "13": {
    "FailureReason": "You need 5 Maelstrom-Infected bricks to build it!"
  },
  "130": {
    "FailureReason": "You need to lease the Chantey Shanty property to use this."
  },
  "131": {
    "FailureReason": "You need to lease the Raven Bluff property to use this."
  },
  "132": {
    "FailureReason": "Use the Rank 1 Adventurer book before doing that."
  },
  "133": {
    "FailureReason": "Use the Rank 1 Shinobi book before doing that."
  },
  "134": {
    "FailureReason": "Use the Rank 1 Space Ranger book before doing that."
  },
  "135": {
    "FailureReason": "Use the Rank 1 Inventor book before doing that."
  },
  "137": {
    "FailureReason": "Talk to Hess LaCoil in Starbase 3001."
  },
  "139": {
    "FailureReason": "You need to power the launcher with the console, then race back to here."
  },
  "140": {
    "FailureReason": "Bob can help you power this console."
  },
  "141": {
    "FailureReason": "Talk to Sky Lane at the Avant Gardens Launch Area."
  },
  "143": {
    "FailureReason": "You need the Staff of Spinning Imagination to use this."
  },
  "144": {
    "FailureReason": "You need the Sword of Fire to use this."
  },
  "145": {
    "FailureReason": "You need the Scythe of Earth to use this."
  },
  "146": {
    "FailureReason": "You need the Shurikens of Ice to use this."
  },
  "147": {
    "FailureReason": "You need the Nunchuks of Lightning to use this."
  },
  "148": {
    "FailureReason": "Nexus Tower still needs more bricks to be finished."
  },
  "149": {
    "FailureReason": "Kurt Tussle will unlock this when you are ready."
  },
  "150": {
    "FailureReason": "Kurt Tussle will unlock this when you are ready."
  },
  "151": {
    "FailureReason": "You don't have the bricks needed."
  },
  "153": {
    "FailureReason": "Use Spinjitzu attacks to destroy this."
  },
  "154": {
    "FailureReason": "See Captain Jack for a Pirate Hook!"
  },
  "156": {
    "FailureReason": "Talk to Dr. Overbuild to use this Quick Build."
  },
  "165": {
    "FailureReason": "You must have 1 Red Imaginite to use this."
  },
  "166": {
    "FailureReason": "You must have 1 Green Imaginite to play."
  },
  "167": {
    "FailureReason": "Activate the Nexus Naomi console in the Sentinel War Room to set up your Vault account."
  },
  "168": {
    "FailureReason": "You must unlock your Vault Account in Nexus Tower to use this ATM."
  },
  "17": {
    "FailureReason": "You don't have the bricks needed."
  },
  "175": {
    "FailureReason": "Wait for Dr. Overbuild to give you a Mission that uses this console."
  },
  "176": {
    "FailureReason": "Wait for Vanda Darkflame to give you a Mission that uses this console."
  },
  "177": {
    "FailureReason": "Wait for Hael Storm to give you a Mission that uses this item."
  },
  "178": {
    "FailureReason": "Wait for Coalessa to give you a Mission that uses this nest."
  },
  "183": {
    "FailureReason": "Duke Exeter will unlock this when you are ready."
  },
  "184": {
    "FailureReason": "Talk to Kurt Tussle to travel to Nexus Tower."
  },
  "185": {
    "FailureReason": "You need 25 Maelstrom-infected bricks."
  },
  "186": {
    "FailureReason": "You need 8 Imagimeter Base chunks to use this Quick Build."
  },
  "187": {
    "FailureReason": "You need a Maelstrom Hammer from Forbidden Valley."
  },
  "188": {
    "FailureReason": "You need a Maelstrom Cube to interact with this."
  },
  "189": {
    "FailureReason": "Talk to Wisp Lee to use this."
  },
  "19": {
    "FailureReason": "Talk to Vector Longview to use this Quick Build."
  },
  "190": {
    "FailureReason": "Talk to Vector Longview to unlock the Monument Race."
  },
  "191": {
    "FailureReason": "Talk to Sky Lane to use this launcher!"
  },
  "2": {
    "FailureReason": "You must have a completed Rocket in your Backpack to use this."
  },
  "20": {
    "FailureReason": "You must be inside a build area."
  },
  "203": {
    "FailureReason": "Talk to Hael Storm before attempting to build the Imagimeter."
  },
  "204": {
    "FailureReason": "Wait for Coalessa to give you a Mission that uses this nest."
  },
  "21": {
    "FailureReason": "Talk to Beck Strongheart, the Sentinel Faction Commander, to use this Quick Build."
  },
  "210": {
    "FailureReason": "You must be Level 3 or greater to use this item."
  },
  "211": {
    "FailureReason": "You must be Level 6 or greater to use this item."
  },
  "212": {
    "FailureReason": "You must be Level 9 or greater to use this item."
  },
  "213": {
    "FailureReason": "You must be Level 12 or greater to use this item."
  },
  "214": {
    "FailureReason": "You must be Level 15 or greater to use this item."
  },
  "215": {
    "FailureReason": "You must be Level 16 or greater to use this item."
  },
  "216": {
    "FailureReason": "You must be Level 18 or greater to use this item."
  },
  "217": {
    "FailureReason": "You must be Level 19 or greater to use this item."
  },
  "218": {
    "FailureReason": "You must be Level 20 or greater to use this item."
  },
  "219": {
    "FailureReason": "You must be Level 21 or greater to use this item."
  },
  "220": {
    "FailureReason": "You must be Level 22 or greater to use this item."
  },
  "221": {
    "FailureReason": "You must be Level 24 or greater to use this item."
  },
  "222": {
    "FailureReason": "You must be Level 25 or greater to use this item."
  },
  "223": {
    "FailureReason": "You must be Level 27 or greater to use this item."
  },
  "224": {
    "FailureReason": "You must be Level 30 or greater to use this item."
  },
  "225": {
    "FailureReason": "You must be Level 33 or greater to use this item."
  },
  "226": {
    "FailureReason": "You must be Level 36 or greater to use this item."
  },
  "227": {
    "FailureReason": "You must be Level 39 or greater to use this item."
  },
  "228": {
    "FailureReason": "You must be Level 40 or greater to use this item."
  },
  "229": {
    "FailureReason": "You must be level 999 or greater to use this item"
  },
  "23": {
    "FailureReason": "Talk to Fitz Vanderbuilt, the Sentinel Faction Engineer, to use this Quick Build."
  },
  "235": {
    "FailureReason": "Talk to Coalessa in Pet Cove."
  },
  "237": {
    "FailureReason": "Talk to Bob to receive your next Mission."
  },
  "24": {
    "FailureReason": "Check with Beck Strongheart, the Sentinel Faction Commander, to use this Quick Build."
  },
  "244": {
    "FailureReason": "Nexus Force Authorization required!"
  },
  "246": {
    "FailureReason": "You must first defeat the Spider Queen to use this!"
  },
  "247": {
    "FailureReason": "Become a LEGO Universe member to explore new worlds!"
  },
  "248": {
    "FailureReason": "You must be Level 10 or greater to use this item."
  },
  "249": {
    "FailureReason": "Talk to Jay in the Dojo of Lightning to use this Catapult."
  },
  "250": {
    "FailureReason": "Talk to Jay in the Dojo of Lightning to use this Catapult."
  },
  "251": {
    "FailureReason": "Bozu Roku can tell you how to unlock this cage."
  },
  "252": {
    "FailureReason": "You need the Skull-a-Ton Instructions to build this. Talk to Bozu Roku."
  },
  "253": {
    "FailureReason": "You must be Level 5 or greater to use this item."
  },
  "254": {
    "FailureReason": "You must be Level 35 or greater to use this item."
  },
  "255": {
    "FailureReason": "You need 3 Spare Parts to rebuild this robot."
  },
  "26": {
    "FailureReason": "You can only use this in certain Build modes."
  },
  "30": {
    "FailureReason": "Talk to Renee Tombcrusher to use this object."
  },
  "32": {
    "FailureReason": "You must collect cannonballs to play Cannon Cove!"
  },
  "33": {
    "FailureReason": "You need the Thinking Hat to use this."
  },
  "34": {
    "FailureReason": "You cannot build this siren. It's missing a piece."
  },
  "36": {
    "FailureReason": "You need to be a member of the Venture League to use this."
  },
  "37": {
    "FailureReason": "You need to be a member of Assembly to use this."
  },
  "38": {
    "FailureReason": "You need to be a member of Paradox to use this."
  },
  "39": {
    "FailureReason": "You need to be a member of the Sentinel Faction to use this."
  },
  "40": {
    "FailureReason": "Talk to Fitz Vanderbuilt, the Sentinel Faction Engineer, to use this Quick Build."
  },
  "44": {
    "FailureReason": "You need the pirate hook."
  },
  "46": {
    "FailureReason": "Faction members only. Find the Recruiter in Nimbus Station and join a Faction!"
  },
  "47": {
    "FailureReason": "Faction members only. Find the Recruiter in Nimbus Station and join a Faction!"
  },
  "48": {
    "FailureReason": "Elephants need peanuts before they can be tamed."
  },
  "49": {
    "FailureReason": "Talk to Johnny Thunder in Nimbus Station."
  },
  "50": {
    "FailureReason": "Talk to Mardolf the Orange in Nimbus Station."
  },
  "51": {
    "FailureReason": "Talk to Mardolf the Orange in Nimbus Station."
  },
  "52": {
    "FailureReason": "You must wear a Maelstrom-Infused Ninja Hood to pass through here."
  },
  "54": {
    "FailureReason": "You need to be wearing a Pirate Hat."
  },
  "59": {
    "FailureReason": "You must be taming a Pet now."
  },
  "6": {
    "FailureReason": "Talk to Sky Lane to learn to build a rocket."
  },
  "60": {
    "FailureReason": "Complete your training before passing."
  },
  "63": {
    "FailureReason": "You must wear a Maelstrom-Infused Ninja Hood to pass through here."
  },
  "64": {
    "FailureReason": "You must wear a Maelstrom-Infused Ninja Hood to pass through here."
  },
  "69": {
    "FailureReason": "Use the Rank 2 Buccaneer book before doing that."
  },
  "7": {
    "FailureReason": "You haven't finished that Mission."
  },
  "70": {
    "FailureReason": "Use the Rank 3 Buccaneer book before doing that."
  },
  "71": {
    "FailureReason": "Use the Rank 2 Daredevil book before doing that."
  },
  "72": {
    "FailureReason": "Use the Rank 3 Daredevil book before doing that."
  },
  "73": {
    "FailureReason": "Use the Rank 2 Adventurer book before doing that."
  },
  "74": {
    "FailureReason": "Use the Rank 3 Adventurer book before doing that."
  },
  "75": {
    "FailureReason": "Use the Rank 2 Sorcerer book before doing that."
  },
  "76": {
    "FailureReason": "Use the Rank 3 Sorcerer book before doing that."
  },
  "77": {
    "FailureReason": "Use the Rank 2 Space Marauder book before doing that."
  },
  "78": {
    "FailureReason": "Use the Rank 3 Space Marauder book before doing that."
  },
  "79": {
    "FailureReason": "Use the Rank 2 Shinobi book before doing that."
  },
  "8": {
    "FailureReason": "Find Bob to unlock your Imagination."
  },
  "80": {
    "FailureReason": "Use the Rank 3 Shinobi book before doing that."
  },
  "81": {
    "FailureReason": "Use the Rank 2 Engineer book before doing that."
  },
  "82": {
    "FailureReason": "Use the Rank 3 Engineer book before doing that."
  },
  "83": {
    "FailureReason": "Use the Rank 2 Inventor book before doing that."
  },
  "84": {
    "FailureReason": "Use the Rank 3 Inventor book before doing that."
  },
  "85": {
    "FailureReason": "Use the Rank 2 Summoner book before doing that."
  },
  "86": {
    "FailureReason": "Use the Rank 3 Summoner book before doing that."
  },
  "87": {
    "FailureReason": "Use the Rank 2 Knight book before doing that."
  },
  "88": {
    "FailureReason": "Use the Rank 3 Knight book before doing that."
  },
  "89": {
    "FailureReason": "Use the Rank 2 Samurai book before doing that."
  },
  "90": {
    "FailureReason": "Use the Rank 3 Samurai book before doing that."
  },
  "91": {
    "FailureReason": "Use the Rank 2 Space Ranger book before doing that."
  },
  "92": {
    "FailureReason": "Use the Rank 3 Space Ranger book before doing that."
  },
  "93": {
    "FailureReason": "See Brickmaster Clang in Forbidden Valley. He can help us escape!"
  },
  "94": {
    "FailureReason": "Sorry, you don't have the bricks needed."
  },
  "95": {
    "FailureReason": "You need to lease the Block Yard property to use this."
  },
  "96": {
    "FailureReason": "Use a Maelstrom Hammer from Forbidden Valley to smash this!"
  },
  "97": {
    "FailureReason": "You need to talk to the Property Launch Pad Guard."
  },
  "98": {
    "FailureReason": "Equip a pirate hat to land at the beach!"
  },
  "99": {
    "FailureReason": "5 Maelstrom-Infected Bricks required."
  }
}
