{
  "256": {
    "FailureReason": "You have to get rid of the Maelstrom first! Fly to Block Yard Property!"
  },
  "257": {
    "FailureReason": "You have already rescued Wilt Bonsai today."
  },
  "258": {
    "FailureReason": "You have already rescued Wo Izemi today."
  },
  "259": {
    "FailureReason": "You have already rescued Waza Matta today."
  },
  "260": {
    "FailureReason": "You have already rescued Hasa Sad today."
  },
  "261": {
    "FailureReason": "You have already rescued Gloomy Megumi today."
  },
  "262": {
    "FailureReason": "You have already rescued Momo Tanpopo today."
  },
  "263": {
    "FailureReason": "Search the attic in the Dojo of Earth to find the Key for this chest."
  },
  "264": {
    "FailureReason": "Search the attic in the Dojo of Ice to find the Key for this chest."
  },
  "265": {
    "FailureReason": "Search the attic in the Dojo of Lightning to find the Key for this chest."
  },
  "266": {
    "FailureReason": "Search the attic in the Dojo of Fire to find the Key for this chest."
  },
  "271": {
    "FailureReason": "You need the Earth Key to open this chest. Cole will tell you where it is."
  },
  "272": {
    "FailureReason": "You need the Ice Key to open this chest. Zane will tell you where it is."
  },
  "273": {
    "FailureReason": "You need the Lightning Key to open this chest. Jay will tell you where it is."
  },
  "274": {
    "FailureReason": "You need the Fire Key to open this chest. Kai will tell you where it is."
  },
  "279": {
    "FailureReason": "You need 5 Rockolate Bars to tame this pet."
  },
  "280": {
    "FailureReason": "Cole can tell you how to summon the pet inside this statue."
  },
  "281": {
    "FailureReason": "Cole can tell you how to summon the pet inside this statue."
  },
  "282": {
    "FailureReason": "Build your rocket to use the launcher."
  },
  "283": {
    "FailureReason": "This Lantern requires Earth Spinjitzu. Cole can teach you how to use it."
  },
  "284": {
    "FailureReason": "This Lantern requires Lightning Spinjitzu. Jay can teach you how to use it."
  },
  "285": {
    "FailureReason": "This Lantern requires Ice Spinjitzu. Zane can teach you how to use it."
  },
  "286": {
    "FailureReason": "This Lantern requires Fire Spinjitzu. Kai can teach you how to use it."
  },
  "287": {
    "FailureReason": "DNL"
  },
  "289": {
    "FailureReason": "See Hari Howzen to unlock this cage again."
  },
  "298": {
    "FailureReason": "You must speak with Sensei Wu to use this."
  },
  "299": {
    "FailureReason": "You must speak with Sensei Wu to use this."
  },
  "318": {
    "FailureReason": "Jay's Pants of Storms"
  },
  "333": {
    "FailureReason": "You must speak with Jay to build this."
  },
  "334": {
    "FailureReason": "You must speak with Jay to build this."
  },
  "341": {
    "FailureReason": "Bozu Roku can tell you how to unlock this cage."
  },
  "342": {
    "FailureReason": "Check your mail box for the Earth Key."
  },
  "343": {
    "FailureReason": "Check your mail box for the Lightning Key."
  },
  "344": {
    "FailureReason": "Check your mail box for the Ice Key."
  },
  "345": {
    "FailureReason": "Check your mail box for the Fire Key."
  },
  "368": {
    "FailureReason": "Become a LEGO Universe member to purchase this item!"
  }
}
