{
  "1": {
    "description": "Blast Stromlings from afar with this ranged weapon! Available from the pirates in Gnarled Forest."
  },
  "10": {
    "description": "The Money Magnet increases the distance at which you pick up coins and other loot. You can get this item from Wisp in Avant Gardens."
  },
  "11": {
    "description": "Show your support for the Pirates with this No Ninjas shirt! Find Captain Jack's Treasure Map to earn it."
  },
  "12": {
    "description": "Become a Master Pet Tamer in Pet Cove and you'll get this Howling Wolf shirt. How-ooooool!"
  },
  "13": {
    "description": "Cross the finish line in this stylish shirt - win it at the Vertigo Loop racetrack in Nimbus Station!"
  },
  "14": {
    "description": "Be an Achiever! Complete 30 Missions or Achievements in Avant Gardens to get this LEGO Universe shirt."
  },
  "15": {
    "description": "Simply stunning! Use this Longsword to stun your opponents into submission."
  },
  "16": {
    "description": "Smash with style! Choose one of 4 different Kung Fu style hammers in Forbidden Valley."
  },
  "18": {
    "description": "ZZZZZ! Watch your enemies snooze when you use this Wand of Sleep on them, available in Gnarled Forest."
  },
  "19": {
    "description": "Become an Uncanny Cannoneer in the Cannon Cove Shooting Gallery and catch Jonesy's Fishing Pole!"
  },
  "2": {
    "description": "Cheer on your favorite team with this flag! Earn it by collecting all the Heart Flags in Gnarled Forest."
  },
  "20": {
    "description": "Protect yourself from harm with this armored Kite Shield. Find it at Kammy Kazei's shop in Forbidden Valley."
  },
  "21": {
    "description": "You'll have quite the feather in your cap when you show off this Imagination-filled Quiver, available now in Gnarled Forest."
  },
  "22": {
    "description": "Deliver the news of your success while wearing this roomy Messenger Bag from Forbidden Valley."
  },
  "23": {
    "description": "This Crown is worth a King's ransom if you can find it. It's rumored to have been stolen by a Dark Ronin in Forbidden Valley."
  },
  "24": {
    "description": "Spark your Imagination with this pointy Witch's Hat, available from the Nimbus Station shops."
  },
  "25": {
    "description": "You'll have to be pretty fast to catch this stylish Black Racing Helmet. Place first in a few races and see if you can get it!"
  },
  "26": {
    "description": "Protect your noggin with this armored Viking Helmet. The pirates in Gnarled Forest won't tell you it's hidden there, but it is."
  },
  "27": {
    "description": "Only the most reputable Builders can achieve this Jester's Hat. One day you may get it too!"
  },
  "28": {
    "description": "Restore your Life with this Tasty Fish. Make sure you get the pink one - the green ones have gone bad."
  },
  "29": {
    "description": "Sentinel Faction members can purchase this Super Soda from their Faction Vendor in Nimbus Station."
  },
  "3": {
    "description": "Battle your enemies with this powerful polearm! Available randomly from enemies in Gnarled Forest."
  },
  "30": {
    "description": "Assembly Faction members can purchase this Awesome Ade from their Faction Vendor in Nimbus Station."
  },
  "31": {
    "description": "Paradox Faction members can purchase this Power Potion from their Faction Vendor in Nimbus Station."
  },
  "32": {
    "description": "Venture League Faction members can purchase this Vitality Vial from their Faction Vendor in Nimbus Station."
  },
  "33": {
    "description": "You and your friends can make up your own games and play them with your LEGO Dice. Earn one in Gnarled Forest."
  },
  "34": {
    "description": "Join the Venture League Faction and earn this pair of Buccaneer's weapons. Find out more in Nimbus Station!"
  },
  "35": {
    "description": "Join the Venture League Faction and earn this pair of Daredevil's weapons. Find out more in Nimbus Station!"
  },
  "36": {
    "description": "Join the Assembly Faction and earn this Engineer's Wrench. Find out more in Nimbus Station!"
  },
  "37": {
    "description": "Join the Sentinel Faction and earn this Knight's Sword. Find out more in Nimbus Station!"
  },
  "38": {
    "description": "Join the Sentinel Faction and earn this Samurai's Katana. Find out more in Nimbus Station!"
  },
  "39": {
    "description": "Join the Paradox Faction and earn this Sorcerer's Wand. Find out more in Nimbus Station!"
  },
  "40": {
    "description": "Join the Paradox Faction and earn this Space Marauder's Blaster. Find out more in Nimbus Station!"
  },
  "41": {
    "description": "Join the Assembly Faction and earn this Summoner's Staff. Find out more in Nimbus Station!"
  },
  "42": {
    "description": "Make a fierce entrance when you build your rocket with this Dragon Rocket Nose Cone. Find it in Forbidden Valley."
  },
  "44": {
    "description": "Avast! Show your pirate spirit by adding this Pirate Nose Cone to your Rocket in Gnarled Forest."
  },
  "45": {
    "description": "The Banana Gun is quite appealing, isn't it? Earn it in the Battle of Nimbus Station!"
  },
  "46": {
    "description": "You'll give your enemies quite the headache with the Headbash Helmet. Earn it in the Battle of Nimbus Station!"
  },
  "47": {
    "description": "Say \"Howdy Pardner\" to all your cowboy friends with this Old West 10 Gallon. Find it in the Battle of Nimbus Station!"
  },
  "48": {
    "description": "Show off your allegiance to the Nexus Force with this spiffy Crux Planet Shield. Earn it in the Battle of Nimbus Station!"
  },
  "5": {
    "description": "Shirts with an image of Pets on them are available to LEGO Club members in LEGO Club, accessed through Nimbus Station."
  },
  "50": {
    "description": "Sinister, but oh so fashionable! Pieces of the Bat Lord kit can be found scattered throughout Crux Prime - but they are extremely rare!"
  },
  "53": {
    "description": "One of the Achievements in your Passport will award these Explorien Pants. The other parts of the costume can be found on Crux Prime!"
  },
  "54": {
    "description": "Get the band back together with this Rockin' Keyboard! Play it after completing the Crux Prime Exterminator 2 Achievement!"
  },
  "55": {
    "description": "Give peas a chance with this Pea Shooter! Buy it from Heimlich Stewblaster in Crux Prime."
  },
  "57": {
    "description": "Get the bugs out! Place this and other Zoo and Safari models on your Property. Buy them in Nimbus Station!"
  },
  "58": {
    "description": "Birds of a feather, build together! Place this and other Zoo and Safari models on your Property. Buy them in Nimbus Station!"
  },
  "6": {
    "description": "Earn a Boom Box by Quick Building all 4 instruments at the Red Blocks concert in Nimbus Station."
  },
  "60": {
    "description": "Ready to explore? Build a rocket with this Venture League Astroscout rocket nosecone. Available at a Venture Faction vendor."
  },
  "61": {
    "description": "Blast off into the Maelstrom! Build a rocket with this Paradox Faction Darkwarp rocket nosecone. Available at a Paradox Faction vendor."
  },
  "62": {
    "description": "Build your way into space! Build a rocket with this Assembly Faction Solarblast rocket engine. Available at an Assembly Faction vendor."
  },
  "63": {
    "description": "Patrol the universe! Build a rocket with this Sentinel Faction Startalon rocket engine. Available at a Sentinel Faction vendor."
  },
  "64": {
    "description": "Blast off with these stylish, yet practical Flight Suit Legs! Available in the Paradox vendor area in Nexus Tower."
  },
  "65": {
    "description": "Protect yourself in style with this Fleur-de-Lis Shield. Only available from Mr. Ree in Nexus Tower - if you can find him!"
  },
  "66": {
    "description": "You'll have your hands full with the Zweihander! Achilles Plutarch sells it in Nexus Tower."
  },
  "68": {
    "description": "Get the improved Sentinel Super Soda 2 - or your own Faction version - available at your Faction Vendor in Nexus Tower!"
  },
  "69": {
    "description": "Can you find this rare Gem Hammer? Only available from Mr. Ree in Nexus Tower - if you can find him!"
  },
  "7": {
    "description": "Picnic baskets contain all kinds of goodies! Find them all over LEGO Universe!"
  },
  "70": {
    "description": "Smite your enemies with this Golden Battle Axe! Achilles Plutarch sells it in Nexus Tower."
  },
  "71": {
    "description": "Burn rubber while racing in the Flaming Tire Shirt - only sold by Rutger Hemoglobin in Nexus Tower."
  },
  "72": {
    "description": "Leap into battle while wearing these Spring Shoes! Get them from Olivia Nightshade in Nexus Tower."
  },
  "73": {
    "description": "Do you have a fertile Imagination? These Sunflower Seeds, available from Olivia Nightshade in Nexus Tower, may surprise you!"
  },
  "74": {
    "description": "Level up! Earn enough Universe Score to reach Level 40 and you'll be rewarded with this stylish Nexus Force cape!"
  },
  "75": {
    "description": "Level up! Earn enough Universe Score to reach Level 10 and you'll be rewarded with this bee-hoot-iful owl!"
  },
  "77": {
    "description": "Do your duty in this Valiant Cape! Buy it from the Sentinel vendor in Nexus Tower at Level 40. Combine it with your Knight's specialty gear!"
  },
  "78": {
    "description": "For honor! Reach Level 40 and you can buy this Valiant Cape from the Sentinel vendor in Nexus Tower. Combine it with your Samurai specialty gear!"
  },
  "79": {
    "description": "Defend the cosmos in this Valiant Cape! Get it at Level 40 from the Sentinel vendor in Nexus Tower. Combine it with your Space Ranger specialty gear!"
  },
  "8": {
    "description": "Brick booster packs contain a bunch of random bricks. Find them all over LEGO Universe!"
  },
  "80": {
    "description": "Be a stylish builder! Buy it from the Assembly vendor in Nexus Tower at Level 40. Combine it with your Engineer specialty gear!"
  },
  "81": {
    "description": "Be a caped creator! Reach Level 40 to buy this Valiant Cape from the Assembly vendor in Nexus Tower. Combine it with your Summoner specialty gear!"
  },
  "82": {
    "description": "Re-invent yourself with this Valiant Cape! Available at Level 40 from the Assembly vendor in Nexus Tower. Combine it with your Inventor specialty gear!"
  },
  "83": {
    "description": "Dare to be bold in this Valiant Cape! Available at Level 40 from the Venture League vendor in Nexus Tower. Combine it with your Daredevil specialty gear!"
  },
  "84": {
    "description": "Buckle your swash in this Valiant Cape! Available at Level 40 from the Venture League vendor in Nexus Tower. Combine it with your Buccaneer specialty gear!"
  },
  "85": {
    "description": "Delve into adventure with this Valiant Cape. Available at Level 40 from the Venture League vendor in Nexus Tower. Combine it with your Adventurer specialty gear!"
  },
  "86": {
    "description": "Strike fear into the Maelstrom in this Valiant Cape! Acquire it at Level 40 from the Paradox vendor in Nexus Tower. Combine it with your Space Marauder specialty gear!"
  },
  "87": {
    "description": "Your enemies will be spellbound by this Valiant Cape! Available at Level 40 from the Paradox vendor in Nexus Tower. Combine it with your Sorcerer specialty gear!"
  },
  "88": {
    "description": "Hide in the shadows of this Valiant Cape! Get it at Level 40 from the Paradox vendor in Nexus Tower. Combine it with your Shinobi specialty gear!"
  },
  "89": {
    "description": "Defend the far reaches of the known Universe in the new Space Ranger specialty kit! Available from the Sentinel vendor in Nimbus Station!"
  },
  "9": {
    "description": "Gems can be sold to vendors for coins. Find them all over LEGO Universe!"
  },
  "90": {
    "description": "Strike from the shadows in the new Shinobi specialty kit! Available from the Paradox vendor in Nimbus Station!"
  },
  "91": {
    "description": "Unleash wacky mayhem in the new Inventor specialty kit! Available from the Assembly vendor in Nimbus Station!"
  },
  "92": {
    "description": "Explore the Universe in the new Adventurer specialty kit! Available from the Venture League vendor in Nimbus Station!"
  },
  "93": {
    "description": "It takes practice to wield Kai's Training Dagger - a weapon with a blade at both ends! Find it in Ninjago!"
  },
  "94": {
    "description": "The Purified Dark Blade: taken from the foul Chopov himself and purified of its Maelstrom infection!"
  },
  "95": {
    "description": "The Sushi Delivery System: only the freshest of fish for your enemies! Find it in Ninjago!"
  },
  "96": {
    "description": "The Thought Blade was created for Ninjago scholars and swordsmen alike."
  },
  "97": {
    "description": "Bring your enemies up close and personal with the Scorpion Whip. Find it, if you can, in Ninjago!"
  },
  "98": {
    "description": "What's better than a pair of nunchuks? Two pair! Wield the Nunchuks of Lightning in both hands. See Sensei Wu in Ninjago."
  }
}
